{
    "intents": [
      {
        "tag": "greeting",
        "patterns": [
          "Hi",
          "Hey",
          "How are you",
          "Is anyone there?",
          "Hello",
          "Good day"
        ],
        "responses": [
          "Hey :-)",
          "Hello, thanks for visiting",
          "Hi there, what can I do for you?",
          "Hi there, how can I help?"
        ]
      },
      {
        "tag": "goodbye",
        "patterns": ["Bye", "See you later", "Goodbye", "Thank you"],
        "responses": [
          "See you later, thanks for visiting",
          "Have a nice day",
          "Bye! Come back again soon."
        ]
      },
      {
        "tag": "cost",
        "patterns": [
          "How much does the stay per day cost?",
          "How much is the cost on weekends?",
          "How much is the cost on weekdays?",
          "Is the cost the same irregardless of the day?",
          "How much?",
          "Rates?"
        ],
        "responses": [
          "The stay costs 6500 pesos on weekdays and 7500 Pesos on the weekends!",
          "The cost depends on the day, 6500 pesos for the weekdays and 7500 Pesos for the weekends!"
        ]
      },
      {
        "tag": "info",
        "patterns": [
          "What is DRT House?",
          "What can we see in the DRT House?",
          "What is the purpose of DRT House?",
          "Details?",
          "What is your information?"
        ],
        "responses": [
          "Diamante Reyes Transient House (DRT House) with Infinity Pool is a complete medium size house with a great mountain view. If you love nature, you will love to stay in the DRT house.",
          "STAYCATION, PAHINGAHAN, FAMILY REUNION, BONDING RELAXATION AND NATURE for you and with your loved one or with the whole family, all available at DRT House!",
          "DRT House with Infinity Pool is a small private resort that you can rent to stay with the beautiful mountain view of the Doña Remedios Trinidad (DRT)."
        ]
      },
      {
        "tag": "location",
        "patterns": [
          "Where are you located?",
          "What is your exact location?",
          "Where can I find you?",
          "Where is your place?",
          "What is the nearest landmark?"
        ],
        "responses": [
          "DRT House with Infinity Pool is located at  Sitio Kutad, Tanawan St. Pulong Sampaloc DRT Bulacan. We are 5 mins away from Carribean Waves Waterpark Resort.",
          "We are located at Sitio Kutad, Tanawan St. Pulong Sampaloc DRT Bulacan.  We are 5 mins away from Carribean Waves Waterpark Resort.",
          "You can locate us on Google Maps, just search for DRT House.",
          "You can use the Waze application to navigate to the location of DRT House."
        ]
      },
      {
        "tag": "headcount",
        "patterns": [
          "How many people can stay in DRT House?",
          "For how many people can stay?",
          "How many pax?",
          "What is the maximum no. of people who can stay?"
        ],
        "responses": [
          "Up to 20 people can stay in the DRT House!",
          "A maximum of 20 persons can stay at the DRT House.",
          "You can stay with your family up to 20 persons at our DRT House."
        ]
      },
      {
        "tag": "room",
        "patterns": [
          "How many people can stay per room?",
          "How many people can fit in your room?",
          "How many people can stay in the teepee house?",
          "How many people can fit in Bahay Kubo?",
          "How many people can stay in the Main House?",
          "How many available rooms?",
          "How many available cottages?",
          "How many rooms?",
          "How many cottages?",
          "How many teepee houses?",
          "How many Bahay Kubo?"
        ],
        "responses": [
          "We have one main house, one bahay kubo and two teepee houses. The Main House can fit 10 persons with the double deck bed, a queen size bed, L-shaped sofa, sofa-bed, and mattresses. We also have a one Bahay kubo with a terrace that can accommodate 3-5 people and two teepee houses that can accommodate 1-2 persons.",
          "There is a main home, a bahay kubo, and two teepee houses. The double deck bed, queen size bed, L-shaped sofa, sofa-bed, and mattresses in the Main House can accommodate ten people. We also have two teepee houses that can accommodate 1-2 people and one Bahay kubo with a terrace that can accommodate 3-5 people.",
          "One main house, one bahay kubo, and two teepee houses are available. With the double deck bed, a queen size bed, an L-shaped sofa, a sofa-bed, and mattresses, the Main House can sleep up to ten people. We also have one Bahay Kubo with a terrace that can sleep 3-5 people and two teepee houses that can sleep 1-2 people."
        ]
      },
      {
        "tag": "time",
        "patterns": [
          "What is your Check-in and check-out time?",
          "Can I adjust my check in time?",
          "Can I extend my check out time?",
          "Can I extend my time?",
          "How many hours is our stay?",
          "How long can we stay in the DRT House?"
        ],
        "responses": [
          "For all of our lovely guests, we have 22 hours to stay in our DRT House and our check-in time is 4:00 PM and the check-out time is 2:00 PM after the day of your check-in. This is strictly followed by all of our guests because we have daily guests and we need to follow the protocols and sanitize the DRT House for our next guest.",
          "We have 22 hours to stay at our DRT House for all of our wonderful guests, with check-in at 4:00 PM and check-out at 2:00 PM on the day of your check-in. Because we have daily guests and need to follow the regulations and disinfect the DRT House for our next visitor, this is carefully followed by all of our guests.",
          "We have 22 hours to remain at our DRT House for all of our wonderful guests, and our check-in time is 4:00 PM and check-out time is 2:00 PM after the day of your check-in. All of our guests carefully adhere to this since we have daily guests and need to follow regulations and disinfect the DRT House for our next guest."
        ]
      },
      {
        "tag": "reservation",
        "patterns": [
          "How can I make a reservation?",
          "Can I make a reservation on the phone?",
          "How do I make a confirmed reservation?",
          "Can I reserve a date?",
          "How can I make a reservation?"
        ],
        "responses": [
          "You can make your reservation by sending 2,000 Pesos in our GCash account and by confirming this transaction we confirm your information for your reservation. Our GCash number is 09326515696. Reservation fee is non-refundable if you cancel your booking.",
          "You may reserve your booking by depositing 2,000 pesos into our GCash account, and by confirming this transaction, we will confirm your reservation details. 09326515696 is our GCash number. Reservation fee is non-refundable if you cancel your booking.",
          "We have a reservation fee of 2,000 Pesos to confirm your booking on your specified date. Our GCash number is 09326515696. Reservation fee is non-refundable if you cancel your booking."
        ]
      },
      {
        "tag": "contacts",
        "patterns": [
          "How can I reach you?",
          "How can I contact you?",
          "What is your contact information?",
          "What are your contacts?",
          "What is your number?",
          "Do you have social media?",
          "Do you have a Facebook page?",
          "What is your Facebook?"
        ],
        "responses": [
          "You may reach us by calling 09326515696 or message us on Facebook by searching DRT House.",
          "You may contact us by calling 09326515696 or message us on Facebook by searching DRT House.",
          "You may reach us by messaging 09326515696 or message us on Facebook by searching DRT House."
        ]
      },
      {
        "tag": "amenities",
        "patterns": [
          "What are your amenities?",
          "What can you offer to your guests?",
          "What services can you offer to us?",
          "What facilities do you have?",
          "What amenities do you have?"
        ],
        "responses": [
          "DRT House has one main house with air conditioning, infinity pool, queen size bed, double deck bed, sofa bed, L-shape sofa, 32\" flat screen tv, refrigerator, bluetooth speaker, gas stove, rice cooker, kettle, complete kitchen utensils, fresh linen and blankets, ihawan, and one Bahay Kubo that can accommodate 3-5 people and two teepee houses that can accommodate 1-3 people each.",
          "We have one main house with air conditioning, infinity pool, queen size bed, double deck bed, sofa bed, L-shape sofa, 32\" flat screen tv, refrigerator, audio system, gas stove, rice cooker, kettle, complete kitchen utensils, fresh linen and blankets, ihawan, and one Bahay Kubo that can accommodate 3-5 people and two teepee houses that can accommodate 1-3 people each.",
          "DRT House has one main house with air conditioning, infinity pool, queen size bed, double deck bed, sofa bed, L-shape sofa, 32\" flat screen tv, refrigerator, bluetooth speaker, gas stove, rice cooker, kettle, complete kitchen utensils, fresh linen and blankets, and ihawan, as well as one Bahay Kubo that can accommodate 3-5 people two teepee houses that can each accommodate 1-3 people."
        ]
      },
      {
        "tag": "payment",
        "patterns": [
          "Do you take credit cards?",
          "Do you accept Mastercard?",
          "Can I pay with Paypal?",
          "Are you cash only?",
          "Do you accept gcash?",
          "Can I pay with gcash?",
          "How can I pay?"
        ],
        "responses": [
          "We accept GCash for reservation and you can make the full payment of your reservation in the venue upon your check in. For complete payment, we take cash or GCash.",
          "We accept GCash for reservations, and you may pay for your reservation in full at the venue when you arrive. We accept cash or GCash for the full payment.",
          "Reservations are accepted in GCash, and you may pay for your reservation in full when you arrive. For complete payment, we take cash or GCash."
        ]
      },
      {
        "tag": "date",
        "patterns": [
          "Available dates?",
          "What are the available dates?",
          "What are your available dates?"
        ],
        "responses": [
          "We are open on weekdays and weekends with different rates. For reservations, you may contact us on 09326515696 or kindly message us on our Facebook page DRT House."
        ]
      },
      {
        "tag": "pool",
        "patterns": [
          "How deep is your pool area?",
          "Do you have a kid area in your pool?",
          "How many feet is your pool?",
          "How deep is your pool?"
        ],
        "responses": [
          "Our pool has a kiddie area that you can enjoy with your kids, and our Pool is 5 feet deep for the adult area.",
          "Our pool features a kiddie area for you to enjoy with your children, and our adult area is 5 feet deep.",
          "Our pool offers a kiddie area that you can enjoy with your children, as well as an adult area that is 5 feet deep."
        ]
      },
      {
        "tag": "parking",
        "patterns": [
          "Do you have space for parking?",
          "Do you have an area for parking?",
          "Do you have a place for parking?",
          "Can I park my car in your area?",
          "Do you have a parking lot?",
          "Where can I park?"
        ],
        "responses": [
          "Yes, we have an allocated space for your parking.",
          "Yes, we have a spacious area for your cars and everything.",
          "Yes we have a place for you in the parking area."
        ]
      }
    ]
  }